<template>
    <div id="Main_page" class="main">
        <article>
            <h2>Элемент "section"</h2>
            Элемент "section" определяет раздел в документе.
            В соответствии со спецификацией W3C по HTML5: "Раздел — это тематически сгруппированный контент, как правило с заголовком."
            Домашняя страница обычно может быть разбита на следующие разделы: вступление, основной контент и контактная информация.
            <h2>Элемент "article"</h2>
            Элемент "article" определяет независимый, самодостаточный контент.
            Контент, помещенный в этот элемент, должен иметь смысл сам по себе, т. е. он должен быть понятен в отрыве от остальных частей веб-сайта.
            В качестве примеров использования элемента "article" могут выступать:
            <ul>
                <li>Публикация на форуме</li>
                <li>Публикация в блоге</li>
                <li>Газетная статья</li>
            </ul>
            <h2>Элемент "header"</h2>
            Элемент "header" предназначен для определения заголовочного блока или "шапки" документа или раздела.
            Элемент "header" следует использовать как контейнер для вводной информации.
            В одном документе разрешается определять несколько элементов "header".
            <h2>Элемент "footer"</h2>
            Элемент "footer" предназначен для определения "подвала" документа или раздела.
            Элемент "footer" должен содержать информацию о содержащим его элементе.
            Обычно в "подвале" размещают информацию об авторе документа, ссылки на условия использования текста, информация об авторских правах, контактные данные и т.п.
            В одном документе разрешается определять несколько элементов "footer".
            <h2>Элемент "nav"</h2>
            Элемент "nav" определяет набор ссылок навигации.
            Обратите внимание, что НЕ ВСЕ ссылки в документе следует размещать внутри элемента "nav". Элемент "nav" предназначен только для основного блока навигационных ссылок.
            <h2>Элемент "aside"</h2>
            Элемент "aside" определяет некий контент, находящийся в стороне от контента, внутри которого он расположен (как боковой блок страницы, "сайдбар").
            Контент внутри элемента "aside" должен соотноситься с окружающим контентом.
            <h2>Элементы "figure" и "figcaption"</h2>
            Назначение элемента "figcaption" - добавление визуального пояснения к изображению.
            В HTML5 изображение и пояснение к нему может быть сгруппировано в элементе "figure"
        </article>
        <p><a href="https://html5css.ru/tags/default.php" class="text-light">Полный список тегов</a></p>
    </div>
</template>

<script>
    export default {
        name: "main"
    }
</script>

<style scoped>
    .main{
        color: white;
        background-color: mediumspringgreen;
    }
    @media screen and (min-width: 1920px) {
        article{
            margin: auto;
            width: 1920px;
        }
    }
</style>